# ScenarioChecker
ScenarioChecker.type.error=Error
ScenarioChecker.type.warning=Warning
ScenarioChecker.type.topography.error=Topography Fehler
ScenarioChecker.type.topography.warning=Topography Warnung
ScenarioChecker.type.simulation.error=Simulations Attribut Fehler
ScenarioChecker.type.simulation.warning=Simulations Attribut Wahrnung
ScenarioChecker.type.model.error=Model Attribute Fehler
ScenarioChecker.type.model.warning=Model Attribute Warnung
ScenarioChecker.type.processor.error=Processor Fehler
ScenarioChecker.type.processor.warning=Procesor Warnung
ScenarioChecker.type.perception.error=Perception Attribut Fehler
ScenarioChecker.type.perception.warning=Perception Attribut Warnung

ScenarioChecker.source.targetIdNotFound=Die folgenden Ziel-IDs wurden nicht im Szenario gefunden.
ScenarioChecker.source.noTargetIdSet=In der Quelle wurden keine Ziel Ids vergeben.
ScenarioChecker.source.noTargetIdAndNoSpawn=In der Quelle wurden keine Ziel Ids vergeben, aber die Spawn Anzahl ist bei 0.
ScenarioChecker.source.spawnAtRandomButNotAtFreeSpace=Kombination aus isSpawnAtRandomPositions=true und isUseFreeSpaceOnly=false kann zu illegalen und unerw√ºnschten Zust√§nden f√ºhren.
ScenarioChecker.source.toSmall=Quelle ist zu klein
ScenarioChecker.source.spawnUseNotAtFreeSpace=useFreeSpaceOnly=false ist Deprecated. Dieses Attribut wird in zuk\u00fcnfigen version entfernt. Nicht alle Modell k\u00f6nnen mit \u00fcberlappungen umgehen.
ScenarioChecker.source.idNotUnique=Quellen haben keine eindeutige ID.
ScenarioChecker.source.needsSpawner=Quelle wurde kein Generator zugewiesen.
ScenarioChecker.stairs.wrongTreadDim=Stufentiefe ist au\u00dferhalb des Definitionsbereichs. Passen Sie die Anzahl der Stufen entsprechend an.
ScenarioChecker.topography.offset=Mit einer gro√üen Verschiebungen des Koordinatenursprung kann es zu Fehlern in den Trajectories kommen. Verschieben Sie den Ursprung auf (0,0) und verwenden Sie den PedestrianOffsetPosition Prozessor. Dieser Prozessor erstellt Trajectories mit einem Offset.
ScenarioChecker.target.unused=Das Ziel wird von keiner Quelle verwendet. Entferne das Ziel um die Performance zu erh\u00f6hen
ScenarioChecker.target.noAbsorber=Die Agenten werden nicht aus dem Szenario entfernt. Es gibt kein Ziel, bei dem "absorb" auf "true" eingestellt ist.
ScenarioChecker.target.notLastAbsorber=Agenten k\u00f6nnen ihr Endziel nicht erreichen, weil sie von einem Zwischenziel absorbiert werden.
ScenarioChecker.pedestrian.speedsetup=speedDistributionMean muss im Bereich min/max liegen.
ScenarioChecker.pedestrian.speedNotLogical=Min or Max Geschwindigkeit ist gr\u00f6\u00dfer als Weltrekord. 
ScenarioChecker.pedestrian.speedIsNegative=Min or Max Geschwindigkeit ist negativ.

ScenarioChecker.overlap.stair.stair=Treppen d\u00fcrfen nicht \u00fcberlappen.
ScenarioChecker.overlap.target.stair=Ein Ziel und eine Treppe \u00fcberlappen im Szenario.
ScenarioChecker.overlap.source.stair=Eine Quelle und eine Treppe \u00fcberlappen im Szenario.
ScenarioChecker.overlap.source.target=Eine Quelle und eine Ziel \u00fcberlappen im Szenario.
ScenarioChecker.overlap.source.source=Zwei Quellen \u00fcberlappen. Wenn useFreeSpaceOnly nicht gesetzt ist kann dies zu \u00fcberlappungen von Pedestrians f\u00fchren.
ScenarioChecker.overlap.target.target=Zwei Ziele \u00fcberlappen.
ScenarioChecker.overlap.obstacle.stairs.err=Treppe ist komplett in einem Hindernis eingeschlossen.
ScenarioChecker.overlap.obstacle.stairs.warn=Treppe \u00fcberlappt mit einem Hindernis. Dies ist m\u00f6glich aber nicht getestet. Wenn m\u00f6glich in zwei Treppen aufteilen.
ScenarioChecker.overlap.obstacle.target.err=Ziel ist komplett in einem Hindernis eingeschlossen
ScenarioChecker.overlap.obstacle.target.warn=Ziel hat ein Hindernis in sich. Dies ist m\u00f6glich reduziert aber die tats\u00c4chliche Fl\u00c4che des Ziels.
ScenarioChecker.overlap.obstacle.source=Hindernis \u00fcberdeckt Quelle. Die f\u00fchrt dazu, dass Pedestrians im Hindernis erzeugt werden.
ScenarioChecker.overlap.obstacle.obstacle=Zwei identische bzw. eingeschlossene Hindernisse gefunden. L\u00f6sche eins f\u00fcr bessere Performance

ScenarioChecker.obstacle.enclose=Engstelle gefunden. 
ScenarioChecker.obstacle.noArea=Die Fl\u00e4che des Hinderniss ist Null. Das Hindernis sollte entfernt werden oder seine Form ver‰ndert.

ScenarioChecker.simAttr.simTimeStepWrong=simTimeStep Parameter au\u00dferhalb des Definitionsbereichs

ScenarioChecker.processor.measurementArea.hasToBeRectangular=Measurement Areas f\u00fcr den AreaDensityVoronoiProcessor m\u00fcssen rechteckig sein
ScenarioChecker.processor.checkAreasInAreaDensityVoronoiProcessor.mismatch=Die Measurement Areas f\u00fcr den AreaDensityVoronoiProcessor passen nicht zusammen. Es muss beachtet werden, dass die Flaeche f\u00fcr die Berechnung der Dichte kleiner (oder gleich) der Flaeche fuer die Generierung des Voronoi-Diagrams sein muss

ScenarioChecker.processor.measuremetarea.doesNotExist=Referenzierte Messfl√§che im Daten Prozessor existiert nicht.

ScenarioChecker.msg.ok=Szenario ok.
ScenarioChecker.msg.warn=Szenario hat Warnungen.
ScenarioChecker.msg.err=Szenario ist Fehlerhaft.
